##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [4]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인
import numpy as np
import pandas as pd
df = pd.read_csv('./data/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 기초문제

In [12]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
# ans_1 = survival_counts = df['Survived'].value_counts().get(1,0)

ans_1 = survival_counts = df['Survived'].value_counts().get(1,0)
ans_2 = survival_counts = df['Survived'].value_counts().get(0,1)
print("생존 :", ans_1)
print("사망 :", ans_2)

생존 : 342
사망 : 549

In [14]:
# 2. 승객 나이의 평균 출력
df['Age'].mean()

29.69911764705882

In [22]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
first_class_passengers = df[df['Pclass'] == 1]
info = first_class_passengers.sort_values(by='Fare', ascending=False).iloc[0]
# print(info)
df.loc[258, 'Name']

'Ward, Miss. Anna'

In [32]:
# 4. 여성 승객의 수를 구하여 출력
df[df['Sex'] == 'female'].shape[0]

314

In [33]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
##### 오른쪽 데이터 항목은 [[]] 두 개 !!!!!! 기억하자 #####
##### 오른쪽 데이터 항목은 [[]] 두 개 !!!!!! 기억하자 #####

df[df['Fare'] >= 50][['Name', 'Fare']]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [69]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
survived = df[df['Age'] <= 18].value_counts('Survived').get(1, 0)
died = df[df['Age'] <= 18].value_counts('Survived').get(0, 1)

# print(survived)
# print(died)

print("생존율 =", survived/(survived+died)*100)

생존율 = 50.35971223021583

In [45]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
class_2 = df[df['Pclass'] == 2]
# print(class_2)
class_2["Fare"].mean()

20.662183152173913

In [50]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
old_customer = df.loc[df['Age'].idxmax()]
print("승객 중 나이가 가장 많은 사람 이름",old_customer["Name"])
print("승객 중 나이가 가장 많은 사람 나이",old_customer["Age"])

승객 중 나이가 가장 많은 사람 이름 Barkworth, Mr. Algernon Henry Wilson
승객 중 나이가 가장 많은 사람 나이 80.0

In [51]:
# 9. S 항구에서 탑승한 승객의 수를 출력
df[df['Embarked'] == 'S'].shape[0]

644

In [54]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
class_3 = df[df['Pclass'] == 3]
class_3["Survived"].value_counts().get(1,0)

119

- 고급문제

In [56]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
survived_mean_age = df[df['Survived'] == 1].groupby('Pclass')['Age'].mean()
died_mean_age = df[df['Survived'] == 0].groupby('Pclass')['Age'].mean()

print("생존자 class별 평균 나이:")
print(survived_mean_age)

print("사망자 class별 평균 나이):")
print(died_mean_age)

생존자 class별 평균 나이:
Pclass
1    35.368197
2    25.901566
3    20.646118
Name: Age, dtype: float64
사망자 class별 평균 나이):
Pclass
1    43.695312
2    33.544444
3    26.555556
Name: Age, dtype: float64

In [57]:
sibsp_top_3 = df[df['SibSp'] >= 3]

fare_top_5 = sibsp_top_3.sort_values(by='Fare', ascending=False).head(5)

print(fare_top_5[['Name', 'Age']])

                                  Name   Age
88          Fortune, Miss. Mabel Helen  23.0
341     Fortune, Miss. Alice Elizabeth  24.0
27      Fortune, Mr. Charles Alexander  19.0
863  Sage, Miss. Dorothy Edith "Dolly"   NaN
324           Sage, Mr. George John Jr   NaN

In [58]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력
age_null = df[df['Age'].isna()]

embarked_distribution = age_null['Embarked'].value_counts()

print(embarked_distribution)

Embarked
S    90
Q    49
C    38
Name: count, dtype: int64

In [59]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력
question = df[(df['Age'] < 16) & (df['SibSp'] == 0) & (df['Parch'] == 0)]
print(question[['Name', 'Sex', 'Survived']])

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [61]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력
question = df[(df['Pclass'] == 1) & (df['Fare'] > df['Fare'].mean())]
print(question[['Name', 'Age', 'Fare']])

                                                  Name   Age      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0   53.1000
6                              McCarthy, Mr. Timothy J  54.0   51.8625
23                        Sloper, Mr. William Thompson  28.0   35.5000
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
..                                                 ...   ...       ...
853                          Lines, Miss. Mary Conover  16.0   39.4000
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667
867               Roebling, Mr. Washington Augustus II  31.0   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0   83.1583

[159 rows x 3 columns]

In [62]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력
# 외우자 ... 솔직히 검색해서 했다..
null_drop = df.dropna(subset=['Age', 'Pclass', 'Fare'])

mean_fare = null_drop.groupby('Pclass')['Fare'].mean()
median_fare = null_drop.groupby('Pclass')['Fare'].median()

# 결과 출력
print("Pclass별 평균 운임:",mean_fare)
print("Pclass별 중앙값 운임:",median_fare)

Pclass별 평균 운임: Pclass
1    87.961582
2    21.471556
3    13.229435
Name: Fare, dtype: float64
Pclass별 중앙값 운임: Pclass
1    69.3000
2    15.0458
3     8.0500
Name: Fare, dtype: float64

In [72]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력

mean_embarked = df.groupby('Embarked')['Age'].mean()

embarked_counts = df['Embarked'].value_counts()

most_frequent_embarked = embarked_counts.idxmax()

survived_most_frequent_embarked = df[df['Embarked'] == most_frequent_embarked]
survive = survived_most_frequent_embarked.value_counts('Survived').get(1, 0)
died = survived_most_frequent_embarked.value_counts('Survived').get(0, 1)


print("Embarked 별 평균 나이:",mean_embarked)
print("가장 많은 승객이 탑승한 항구: ",most_frequent_embarked)
print("생존율: ",survive/(survive+died)*100)

Embarked 별 평균 나이: Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64
가장 많은 승객이 탑승한 항구:  S
생존율:  33.69565217391305

In [68]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

female_30 = df[(df['Sex'] == 'female') & (df['Age'] >= 30)]
survive = female_30.value_counts('Survived').get(1, 0)
died = female_30.value_counts('Survived').get(0, 1)

print("생존율 : ",survive/(survive+died)*100)

생존율 :  80.7017543859649

In [75]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

over_3 = df[(df['SibSp'] + df['Parch']>= 3)]
survive = over_3.value_counts('Survived').get(1, 0)
died = over_3.value_counts('Survived').get(0, 1)

print("생존율 : ",survive/(survive+died)*100)

생존율 :  34.065934065934066

In [84]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력
null_drop = df.dropna(subset=['Cabin'])

question = null_drop.groupby('Pclass')['Survived'].value_counts()
# print(question)

survive = question.get((1, 1), 0)  
died = question.get((1, 0), 0)     
survive_2 = question.get((2, 1), 0)  
died_2 = question.get((2, 0), 0)    
survive_3 = question.get((3, 1), 0)  
died_3 = question.get((3, 0), 0)    

survival_rate_1 = survive / (survive + died) * 100
survival_rate_2 = survive_2 / (survive_2 + died_2) * 100
survival_rate_3 = survive_3 / (survive_3 + died_3) * 100

print("Pclass 1 생존율: ",survival_rate_1)
print("Pclass 2 생존율: ",survival_rate_2)
print("Pclass 3 생존율: ",survival_rate_3)

Pclass 1 생존율:  66.47727272727273
Pclass 2 생존율:  81.25
Pclass 3 생존율:  50.0